//WRLRASVT  JOB  ,'R/ROBINSON',MSGCLASS=X,CLASS=S
//*
//*
//*
//* --------CHKASVT:  TO INTERROGATE ASVT VALUES
//*
//CHKIT     EXEC  PGM=CHKASVT
//STEPLIB   DD    DSN=WHMS.LINKLIB.LOAD,DISP=SHR
//SYSPRINT  DD    SYSOUT=*
//SYSOUT    DD    SYSOUT=*
//*
//* --------RESOLVE:  TO DISPLAY STATUS OF ALL ASIDS
//*
//STATUS    EXEC  PGM=RESOLVE,PARM='BATCH'
//BBHELP    DD    DSN=STDL.CMF.R520.BBHELP,DISP=SHR
//INTRDR    DD    SYSOUT=(*,INTRDR)
//LOG       DD    SYSOUT=*,BLKSIZE=141
//TRACK     DD    SYSOUT=*,BLKSIZE=141
//SYSPRINT  DD    SYSOUT=*
//SYSIN     DD    *
STATUS ALL SHORT
END
/*
//
//* YOU CAN USE THE DA PROGRAM FROM CBT FILE 300 TO
//* DISPLAY ALL OF THE ACTIVE ASID'S RUNNING IN THE
//* SYSTEM.  THE ASID NUMBERS DISPLAYED BY THE DA
//* COMMAND ARE IN HEX, SO DON'T GET CONFUSED.  THE
//* PROPER COMMAND IS:   TSO DA A
//* YOU DON'T NEED THE VENDOR PRODUCT, RESOLVE.
